SUCCESS_UPDATE_SPACE = (
    '▶️     База изменена на {space_name}\n'
    '▶️     <u>Период:</u> {current_month}_{current_year}'
)
FAIL_UPDATE_SPACE = '❗️ Ошибка при изменении базы. Попробуйте позже ❗️'
CHOOSE_SPACE = (
    '⚙️    <b><u>Выбор базы</u></b>    ⚙️\n'
    '\n'
    'Список доступных баз:\n'
    '\n'
    '⌨️'
)
DELETE_USER = (
    '❗️ Подтвердите удаление аккаунта ❗️\n'
    '❗️ В случае подтверждения все данные будут удалены безвозвратно ❗️'
)
SUCCESS_DELETE_USER = '❗ ️ Аккаунт удален ❗️'
CANCEL_DELETE_USER = '▶️     Вы отменили удаление аккаунта'